Repository: mksddn/wp-theme
Catalog: languages/wp-theme-*.po
Languages: ru_ru

source: Image size too large. Maximum size is %dMB.
ru_ru: Размер изображения превышает лимит. Максимум: %dМБ.

source: Category Thumbnail
ru_ru: Миниатюра категории

source: Upload category thumbnail image
ru_ru: Загрузить изображение категории

source: Upload Image
ru_ru: Загрузить изображение

source: Remove category thumbnail image
ru_ru: Удалить изображение категории

source: Remove Image
ru_ru: Удалить изображение

source: Security check failed
ru_ru: Ошибка проверки безопасности

source: File Size
ru_ru: Размер файла

source: N/A
ru_ru: Н/Д

source: Thumbnail
ru_ru: Миниатюра

source: None
ru_ru: Нет

source: Duplicate this post
ru_ru: Дублировать этот пост

source: Duplicate
ru_ru: Дублировать

source: Invalid parameters
ru_ru: Неверные параметры

source: Security error
ru_ru: Ошибка безопасности

source: Insufficient permissions
ru_ru: Недостаточно прав доступа

source: Post not found
ru_ru: Запись не найдена

source: Error creating duplicate
ru_ru: Не удалось создать копию

source: Post successfully duplicated!
ru_ru: Запись успешно скопирована!

source: Theme Features
ru_ru: Функции темы

source: Admin Features
ru_ru: Функции панели управления

source: Content Features
ru_ru: Функции контента

source: Security Features
ru_ru: Функции безопасности

source: Search Features
ru_ru: Функции поиска

source: Image Optimization
ru_ru: Оптимизация изображений

source: Performance Features
ru_ru: Оптимизация производительности

source: Configure theme features and functionality. Enable or disable specific features based on your needs.
ru_ru: Настройте функции и возможности темы. Включайте или отключайте конкретные функции в зависимости от ваших потребностей.

source: Warning:
ru_ru: Предупреждение:

source: Settings are using default values. Database option 'wp_theme_settings' not found. Save settings to create the option.
ru_ru: Используются значения по умолчанию. Опция базы данных 'wp_theme_settings' не найдена. Сохраните настройки, чтобы создать опцию.

source: Save Theme Features
ru_ru: Сохранить функции темы

source: About Theme Features
ru_ru: О функциях темы

source: This page allows you to enable or disable various theme features. Changes take effect immediately after saving.
ru_ru: На этой странице вы можете включать или отключать различные функции темы. Изменения вступают в силу сразу после сохранения.

source: Note:
ru_ru: Примечание:

source: Some features require specific plugins to be installed and activated.
ru_ru: Некоторые функции требуют установки и активации определенных плагинов.

source: Settings source:
ru_ru: Источник настроек:

source: Backup &amp; Restore Settings
ru_ru: Резервное копирование и восстановление настроек

source: Use these tools to backup or restore theme settings. Useful for migrations.
ru_ru: Используйте эти инструменты для резервного копирования или восстановления настроек темы. Полезно при миграциях.

source: Export Settings
ru_ru: Экспорт настроек

source: Export Settings as JSON
ru_ru: Экспортировать настройки в JSON

source: Import Settings
ru_ru: Импорт настроек

source: Import Settings from JSON
ru_ru: Импортировать настройки из JSON

source: Admin interface enhancements, WordPress core modifications, and administrative tools.
ru_ru: Улучшения административного интерфейса, модификации ядра WordPress и административные инструменты.

source: Content editing, display, and formatting features including editor settings.
ru_ru: Функции редактирования, отображения и форматирования контента, включая настройки редактора.

source: WordPress security enhancements and hardening measures.
ru_ru: Улучшения безопасности WordPress и меры по усилению защиты.

source: Search functionality enhancements and optimizations.
ru_ru: Улучшения и оптимизации функциональности поиска.

source: Image optimization features, media library enhancements, and file format support for better performance and user experience.
ru_ru: Функции оптимизации изображений, улучшения медиатеки и поддержка форматов файлов для лучшей производительности и удобства использования.

source: Basic performance optimizations to improve site speed and reduce server load. These settings are safe to enable and won't conflict with most plugins.
ru_ru: Базовые оптимизации производительности для повышения скорости сайта и снижения нагрузки на сервер. Эти настройки безопасны для включения и не конфликтуют с большинством плагинов.

source: Enable headless CMS mode (API only, no theme assets)
ru_ru: Включить режим headless CMS (только API, без ресурсов темы)

source: Disables frontend theme, enables API-only usage
ru_ru: Отключает фронтенд темы, включает использование только через API

source: Cyr to Lat (transliteration)
ru_ru: Кириллица в латиницу (транслитерация)

source: Converts Cyrillic characters to Latin in URLs and filenames
ru_ru: Преобразует кириллические символы в латинские в URL и именах файлов

source: Enable ACF Local JSON with automatic path management
ru_ru: Включить ACF JSON с автоматическим управлением

source: Saves ACF field groups as JSON files in theme
ru_ru: Сохраняет группы полей ACF как JSON файлы в теме

source: Disable comments
ru_ru: Отключить комментарии

source: Completely removes comment functionality from posts and pages
ru_ru: Отключает комментарии для всех записей и страниц

source: Duplicate Post feature
ru_ru: Функция дублирования записей

source: Adds duplicate button to post edit screens
ru_ru: Добавляет кнопку копирования при редактировании

source: Plugins logger
ru_ru: Логгер плагинов

source: Logs plugin activation/deactivation events
ru_ru: Ведёт логи активации и деактивации плагинов

source: WooCommerce support
ru_ru: Поддержка WooCommerce

source: Adds theme support for WooCommerce plugin
ru_ru: Включает совместимость темы с WooCommerce

source: Polylang REST API language detection
ru_ru: Определение языка в Polylang REST API

source: Automatically detects language from Accept-Language header in REST API requests
ru_ru: Автоматически выбирает язык по заголовку Accept-Language в REST API

source: Disable Gutenberg
ru_ru: Отключить Gutenberg

source: Reverts to classic editor for all post types
ru_ru: Использует классический редактор для всех типов записей

source: Add excerpt support to pages
ru_ru: Добавить поле описания для страниц

source: Enables excerpt field for pages in admin
ru_ru: Включает поле описания для страниц

source: Remove "Category: ", "Tag: " etc. from archive title
ru_ru: Убрать "Категория: ", "Метка: " из заголовка архива

source: Shows only the term name
ru_ru: Показывает только имя термина

source: Remove H2 from pagination template
ru_ru: Убрать H2 из пагинации

source: Removes default heading wrapper from pagination
ru_ru: Убирает стандартный заголовок из пагинации

source: Posts list: thumbnail column
ru_ru: Список записей: колонка миниатюр

source: Shows featured image thumbnails in posts list
ru_ru: Показывает миниатюры в списке записей

source: Category thumbnails
ru_ru: Миниатюры категорий

source: Adds thumbnail support for categories with admin interface and REST API
ru_ru: Добавляет изображения для категорий с поддержкой API

source: Schema.org structured data markup
ru_ru: Разметка структурированных данных Schema.org

source: Adds structured data for better SEO
ru_ru: Добавляет структурированные данные для SEO

source: Disable XML-RPC
ru_ru: Отключить XML-RPC

source: Blocks XML-RPC requests to prevent brute force attacks
ru_ru: Блокирует XML-RPC для защиты от перебора пароля

source: Disable X-Pingback header
ru_ru: Отключить заголовок X-Pingback

source: Removes pingback header to hide WordPress
ru_ru: Отключает pingback для скрытия версии

source: Hide WordPress version
ru_ru: Скрыть версию WP

source: Removes version info from head and RSS feeds
ru_ru: Убирает версию из head и RSS

source: Disable file editing in admin
ru_ru: Отключить редактор кода в панели

source: Prevents theme/plugin editing via admin
ru_ru: Запрещает изменение кода темы и плагинов

source: Disable user enumeration
ru_ru: Отключить перечисление пользователей

source: Blocks user discovery via author archives
ru_ru: Блокирует обнаружение пользователей через архивы авторов

source: Add security headers (except CSP)
ru_ru: Добавить заголовки безопасности (кроме CSP)

source: Adds X-Frame-Options, X-Content-Type-Options, Referrer-Policy, HSTS
ru_ru: Добавляет X-Frame-Options, X-Content-Type-Options, Referrer-Policy, HSTS

source: Add Content-Security-Policy (CSP) header
ru_ru: Добавить заголовок Content-Security-Policy (CSP)

source: Sends CSP header to restrict resource loading
ru_ru: Отправляет заголовок CSP для ограничения загрузки ресурсов

source: Disable directory browsing
ru_ru: Отключить просмотр директорий

source: Prevents directory listing on server
ru_ru: Предотвращает листинг директорий на сервере

source: Limit login attempts
ru_ru: Ограничить попытки входа

source: Adds basic login attempt limiting
ru_ru: Ограничивает количество попыток входа

source: Stop query execution for empty search terms
ru_ru: Остановить выполнение запроса для пустых поисковых запросов

source: Prevents database queries when search is empty
ru_ru: Не выполняет поиск при пустом запросе

source: Select post types to include in search (leave empty to search all):
ru_ru: Выберите типы для поиска (пусто = все):

source: Post/Page IDs to exclude:
ru_ru: ID для исключения из поиска:

source: Enter IDs separated by commas
ru_ru: Введите ID через запятую

source: Slugs to exclude:
ru_ru: Слаги для исключения:

source: Enter slugs separated by commas
ru_ru: Введите слаги через запятую

source: Enable upload size and dimension limits
ru_ru: Включить ограничения размера и размеров загрузки

source: Restricts image upload size and dimensions
ru_ru: Ограничивает размер и размеры загружаемых изображений

source: Optimize image quality
ru_ru: Улучшить качество сжатия

source: Sets JPEG compression quality for better file sizes
ru_ru: Настраивает качество JPEG для меньшего размера файла

source: Enable priority loading for above-the-fold images
ru_ru: Загружать изображения в первую очередь

source: Loads featured images immediately
ru_ru: Загружает основные изображения в первую очередь

source: Media Library: file size column
ru_ru: Медиатека: колонка размера файла

source: Shows file size in Media Library list view
ru_ru: Показывает размер файла в виде списка медиатеки

source: SVG support
ru_ru: Поддержка SVG

source: Allows safe SVG file uploads with sanitization
ru_ru: Разрешает загрузку SVG с защитой от вредоноса

source: Upload Limits
ru_ru: Ограничения загрузки

source: Maximum image size (MB):
ru_ru: Максимальный размер изображения (МБ):

source: Maximum dimension (px):
ru_ru: Максимальное разрешение (px):

source: Image Quality
ru_ru: Качество изображения

source: JPEG Quality (%):
ru_ru: Качество JPEG (%):

source: General Quality (%):
ru_ru: Общее качество (%):

source: Thumbnail (150x150px)
ru_ru: Миниатюра (150x150px)

source: Medium (300x300px)
ru_ru: Среднее (300x300px)

source: Medium Large (768x768px)
ru_ru: Среднее большое (768x768px)

source: Large (1024x1024px)
ru_ru: Большое (1024x1024px)

source: 1536x1536 (WordPress 5.3+ large size)
ru_ru: 1536x1536 (большой размер WordPress 5.3+)

source: 2048x2048 (WordPress 5.3+ large size)
ru_ru: 2048x2048 (большой размер WordPress 5.3+)

source: Remove Intermediate Sizes
ru_ru: Убрать дополнительные размеры

source: Select sizes to remove (leave empty to keep all sizes):
ru_ru: Выберите размеры (пусто = все):

source: Remove WordPress emoji scripts
ru_ru: Удалить скрипты эмодзи WordPress

source: Removes emoji detection and styles for faster loading
ru_ru: Убирает эмодзи для ускорения загрузки

source: Disable WordPress embeds
ru_ru: Отключить встраивание контента

source: Removes oEmbed functionality to reduce HTTP requests
ru_ru: Удаляет функциональность oEmbed для уменьшения HTTP запросов

source: Optimize database queries
ru_ru: Оптимизировать запросы к базе данных

source: Removes unnecessary meta links and queries
ru_ru: Убирает ненужные мета-ссылки

source: Clean up unnecessary head elements
ru_ru: Очистить ненужное из head

source: Removes feed links and adjacent post links
ru_ru: Убирает ссылки на RSS и соседние записи

source: Disable WordPress cron (use server cron)
ru_ru: Отключить cron WordPress (использовать cron сервера)

source: Disables WP cron for better performance
ru_ru: Отключает cron WP для ускорения

source: Limit post revisions
ru_ru: Ограничить черновики записей

source: Limits number of post revisions to reduce database size
ru_ru: Сохраняет только последние черновики

source: Max revisions per post:
ru_ru: Максимум ревизий на запись:

source: Unauthorized
ru_ru: Доступ запрещен

source: Invalid nonce
ru_ru: Ошибка проверки безопасности

source: Failed to encode settings
ru_ru: Не удалось закодировать настройки

source: File upload error. Please try again.
ru_ru: Не удалось загрузить файл

source: Failed to read file.
ru_ru: Не удалось прочитать файл.

source: Invalid JSON format. Error:
ru_ru: Неверный JSON:

source: Settings imported successfully!
ru_ru: Настройки успешно импортированы!
